[{"fileName":"cli-tool.html","title":"CLI tool intro","body":"<p>Elven Tools CLI tool introduction</p> <p>TODO:</p> <ol>   <li>Review of all functions with descriptions</li>   <li>Review of the config file possibilities</li>   <li>Show example on how to work with and with local files for Smart Contract</li>   <li></li> </ol>","excerpt":"","publicationDate":"2022-01-25","tags":["cli tool"],"coverImage":""},{"fileName":"landing-page.html","title":"Landing page template","body":"<p>Landing page based on the Next framework.</p> <p>Comming soon!</p>","excerpt":"","publicationDate":"2022-01-25","tags":["landing page"],"coverImage":""},{"fileName":"sc-functions.html","title":"Functions","body":"<p>Below you'll find all endpoints with short description. You can always see whole code <a href=\"https://github.com/juliancwirko/elven-nft-minter-sc\">here</a>.</p> <h3>Only owner endpoints</h3> <p>Endpoints which can be called only by the owner. In such a Smart Contract there are quite a lot of them.</p> <ul>   <li><code>init</code> - standard init function, it will be triggered on deployment and upgrade</li>   <li><code>issueToken</code> - required endpoint for creating a new collection, this is done once, and the token is one for one smart contract instance. This is a handler for the whole collection. You can read more about it <a href=\"https://docs.elrond.com/developers/nft-tokens/#issuance-of-non-fungible-tokens\">here</a></li>   <li>``</li> </ul> <h3>Endpoints for all</h3> <h3>Smart Contract queries</h3>","excerpt":"","publicationDate":"2022-01-24","tags":["smart contract"],"coverImage":""},{"fileName":"sc-introduction.html","title":"Introduction","body":"<p>NFT minter Smart Contract v1</p> <div class=\"docs-error-box\">Be aware that the Smart Contract doesn't have any audits, and because it is pretty new, there wasn't a lot of testing either. You will use it at your own risk!</div> <p>You are reading about the Smart Contract designed for the Elrond blockchain. Its primary purpose is to provide a simple logic for minting and buying NFT tokens from a previously configured collection. It does it in a randomized way.</p> <h3>Version 1 supports</h3> <ul>   <li>issuing the collection token</li>   <li>setting the create role</li>   <li>pausing/unpausing the process</li>   <li>random mint and distribution</li>   <li>minting multiple NFTs in one transaction</li>   <li>giveaway options</li>   <li>possibility to split the process into drops/waves</li>   <li>claiming the developer rewards</li>   <li>changing basic setup where it is possible</li> </ul> <p>The smart contract works like a candy machine. In short, the user can pay in EGLD and, in return, will get randomly minted tokens from the previously configured collection. The amount of tokens per address is configured on the smart contract.</p> <h3>Ways of using it</h3> <p>The best way of using it will be with <a href=\"/docs/cli-tool\">Elven Tools CLI tool</a>. It has a lot of valuable functions integrated with the smart contract, so deploying or interacting is simple. You can deploy the smart contract directly from its repository. Almost no coding skills are required in this case.</p> <p>You can also take a more standard path and use <a href=\"https://docs.elrond.com/sdk-and-tools/erdpy/erdpy/\">erdpy</a> for that. Erdpy is an official CLI SDK for Elrond blockchain based on Python. For more information, check the <a href=\"https://www.julian.io/articles/elrond-smart-contracts.html\">blog post</a>.</p> <h3>Limitations and caveats</h3> <ul>   <li>Remember that it is most likely that because of the open-source nature of this Smart Contract, it won't be used only in a way that everyone would want to, be aware that you can always change the names of the endpoints in the Smart Contract. You can even deploy a couple of them. In the last minutes before the mint decide to use one of them. This will limit the bots. Remember always to inform which one is the official one.</li>   <li>Smart Contract in version 1 doesn't have many mechanisms which will strongly limit unwanted behaviors. It only implements random minting, but in version 2, there will be more mechanisms for fair launches.</li> </ul> <div class=\"next-page-link\">Next: <a href=\"/docs/sc-functions.html\">SC functions review</a></div>","excerpt":"","publicationDate":"2022-01-25","tags":["smart contract"],"coverImage":""}]